---
kind: method
id: M:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AreEqualTo(Autodesk.Revit.DB.ICustomFieldProperties)
source: html/f18895ca-d558-b438-62f8-fd23f15e14a6.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AreEqualTo Method

Identifies if the custom field properties are equal or not.

## Syntax (C#)
```csharp
public virtual bool AreEqualTo(
	ICustomFieldProperties otherProperties
)
```

## Parameters
- **otherProperties** (`Autodesk.Revit.DB.ICustomFieldProperties`) - The other properties.

## Returns
Returns true if the custom field properties are equal, false otherwise.